function setup() {
  createCanvas(400, 400);
  background(220);

  // 얼굴
  fill(255, 224, 189); // 피부색
  noStroke();
  ellipse(200, 200, 220, 250);

  //머리카락
  fill(0);
  noStroke();
  arc(200, 170, 200, 200, PI + PI / 6, TWO_PI - PI / 6, CHORD);

  //똥머리
  fill(0);
  ellipse(200, 50, 80, 80);

  // 눈썹 (일자, 직사각형)
  fill(0);
  rect(130, 130, 50, 10, 6); // 왼쪽 눈썹
  rect(220, 130, 50, 10, 6); // 오른쪽 눈썹

  // 눈 (흰자)
  fill(255);
  ellipse(150, 170, 50, 40); // 왼쪽 눈
  ellipse(250, 170, 50, 40); // 오른쪽 눈

  // 동공
  fill(0);
  ellipse(150, 170, 20, 20);
  ellipse(250, 170, 20, 20);

  // 속눈썹 (line으로 추가)
  stroke(0);
  strokeWeight(2);
  line(130, 160, 120, 150); // 왼쪽 눈 속눈썹 1
  line(140, 150, 135, 140); // 왼쪽 눈 속눈썹 2
  line(160, 150, 165, 140); // 왼쪽 눈 속눈썹 3

  line(230, 155, 220, 140); // 오른쪽 눈 속눈썹 1
  line(250, 150, 250, 135); // 오른쪽 눈 속눈썹 2
  line(270, 155, 280, 140); // 오른쪽 눈 속눈썹 3

  // 코 (삼각형)
  noStroke();
  fill(200, 200, 100);
  triangle(200, 180, 190, 220, 210, 220);

  // 볼터치 (빨간색)
  fill(255, 100, 100, 150);
  ellipse(120, 220, 55, 50); // 왼쪽 볼터치
  ellipse(280, 220, 55, 50); // 오른쪽 볼터치

  // 입
  stroke(0);
  strokeWeight(2);
  noFill();
  arc(200, 260, 80, 40, 0, PI); // 웃는 입
}
